export default async (req, res) => {
  res.status(200).json({
    text1: 'Хранитель знаний уходил, после того, как передал весь опыт своим ученикам',
    text2: 'Ученик просили хранителя остаться',
    text3: 'Хранитель отвечал: "Придёт новый Хранитель"',
    text4: '"Как мы его узнаем?", - спрашивали ученики',
    text5: 'Хранитель отвечал: "Он придёт по следующему пути:"',
    step1: 'Он придёт из промо, ой, из прошлого, что было на это сайте',
    step2: 'Нажмёт F12',
    step3: 'Откроет Console, а может и Консоль',
    step4: 'Введёт i_am_knowledge_keeper = true',
    step5: 'Откроет источник, к которому все стремятся',
    text6: 'Хранитель знаний уходил, оставив своих учеников размышлять над загадкой',
  });
};
